**Łączenie danych z większej ilości obiektów data frame**

In [1]:
import pandas as pd
import numpy as np

In [3]:
products = pd.read_csv('C:/Users/Mariusz Baran/Data_Science_kurs/Data_science_pliki/course-files/northwind/products.csv',
                      usecols=['ProductID', 'ProductName', 'CategoryID', 'UnitPrice'])
categories = pd.read_csv('C:/Users/Mariusz Baran/Data_Science_kurs/Data_science_pliki/course-files/northwind/categories1.csv',
                        usecols=['CategoryID', 'CategoryName', 'Description'])
orders = pd.read_csv('C:/Users/Mariusz Baran/Data_Science_kurs/Data_science_pliki/course-files/northwind/order-details.csv')

In [4]:
products.head(2)

   ProductID ProductName  CategoryID  UnitPrice
0          1        Chai           1       18.0
1          2       Chang           1       19.0

In [5]:
categories.head(2)

   CategoryID CategoryName              Description
0           1    Beverages              Soft drinks
1           2   Condiments  Sweet and savory sauces

In [6]:
orders.head(2)

   OrderID  ProductID  UnitPrice  Quantity  Discount
0    10248         11       14.0        12       0.0
1    10248         42        9.8        10       0.0

Metodą merge można łączyć tylko dwie tabele - trzeba połączyć dwa razy

In [7]:
cat_prod = products.merge(categories, on='CategoryID')
cat_prod.head(2)

   ProductID ProductName  CategoryID  UnitPrice CategoryName  Description
0          1        Chai           1       18.0    Beverages  Soft drinks
1          2       Chang           1       19.0    Beverages  Soft drinks

In [9]:
cat_prod.merge(orders, on='ProductID', suffixes=['_prod', '_order']).head(2)

,ProductID,ProductName,CategoryID,UnitPrice_prod,CategoryName,Description,OrderID,UnitPrice_order,Quantity,Discount
0,1,Chai,1,18.0,Beverages,Soft drinks,10285,14.4,45,0.2
1,1,Chai,1,18.0,Beverages,Soft drinks,10294,14.4,18,0.0